Amiya200/stm32_water_tank/Core/Src/model_handle.c
    if (modeState.auto_on)
    {
        uint8_t level = ModelHandle_GetTankLevelPercent();
        autoActive = (level <= AUTO_START_LEVEL_PERCENT);
    }
    else
    {
        autoActive = false;
    }

    /* Timer mode only persists when auto is also active */
    if (timerActive && !autoActive)
        timerActive = false;
}

void ModelHandle_SaveTimerToEEPROM(void)
{
    TimerEEPROMBlock blk;
    memset(&blk, 0, sizeof(blk));
    blk.signature = TIMER_EE_SIGNATURE;
    blk.version   = TIMER_EE_VERSION;
    memcpy(blk.slots, timerSlots, sizeof(timerSlots));
    blk.crc = Timer_CRC16((uint8_t*)&blk, sizeof(blk) - sizeof(uint16_t));
    EEPROM_WriteBuffer(EE_ADDR_TIMER_BLOCK, (uint8_t*)&blk, sizeof(blk));
}

void ModelHandle_LoadTimerFromEEPROM(void)
{
    TimerEEPROMBlock blk;
    EEPROM_ReadBuffer(EE_ADDR_TIMER_BLOCK, (uint8_t*)&blk, sizeof(blk));
    if (blk.signature != TIMER_EE_SIGNATURE) return;
    uint16_t crc = Timer_CRC16((uint8_t*)&blk, sizeof(blk) - 2);
    if (blk.crc != crc) return;
    memcpy(timerSlots, blk.slots, sizeof(timerSlots));
}

void Timer_EEPROM_EnsureValid(void)
{
    TimerEEPROMBlock blk;
    EEPROM_ReadBuffer(EE_ADDR_TIMER_BLOCK, (uint8_t*)&blk, sizeof(blk));
    uint16_t crc = Timer_CRC16((uint8_t*)&blk, sizeof(blk) - 2);
    if (blk.signature != TIMER_EE_SIGNATURE || blk.crc != crc)
    {
        memset(timerSlots, 0, sizeof(timerSlots));
        ModelHandle_SaveTimerToEEPROM();
    }
}

void ModelHandle_SendTimerInfoUART(void)
{
    char buf[128];
    for (int i = 0; i < 5; i++)
    {
        const TimerSlot *t = &timerSlots[i];
        snprintf(buf, sizeof(buf),
            "@TSLOT:%d:%02u:%02u:%02u:%02u:0x%02X:%d#",
            i + 1,
            t->onHour, t->onMinute,
            t->offHour, t->offMinute,
            t->dayMask,
            t->enabled);
        UART_TransmitPacket(buf);
    }
}

static uint8_t read_raw_tank_level(void)
{
    uint8_t level = 0;
    if (adcData.voltages[3] < PROBE_THRESHOLD) level = 25;
    if (adcData.voltages[2] < PROBE_THRESHOLD) level = 50;
    if (adcData.voltages[1] < PROBE_THRESHOLD) level = 75;
    if (adcData.voltages[0] < PROBE_THRESHOLD) level = 100;
    return level;
}

static uint8_t get_tank_level_percent(void)
{
    static uint8_t  stableLevel    = 0;
    static uint8_t  candidateLevel = 0;
    static uint32_t changeTime     = 0;

    uint32_t now      = HAL_GetTick();
    uint8_t  rawLevel = read_raw_tank_level();

    if (rawLevel != stableLevel)
    {
        if (rawLevel != candidateLevel)
        {
            candidateLevel = rawLevel;
            changeTime     = now;
        }
        if ((now - changeTime) >= SENSOR_STABLE_TIME_MS)
            stableLevel = candidateLevel;
    }
    return stableLevel;
}

static bool isTankFull(void)
{
    return (get_tank_level_percent() == 100);
}

void ModelHandle_StartRestart(void)
{
    if (isTankFull()) return;
    backup_current_mode();
    clear_all_modes();
    restartActive   = true;
    restartState    = RESTART_RUN_CONTINUOUS;
    restartDeadline = 0;
    motorOwner      = MOTOR_OWNER_RESTART;
    senseMaxRunReached = false;
    dryState = DRY_IDLE;
    start_motor();
}

void ModelHandle_TimerRecalculateNow(void)
{
    if (!timerActive) return;
    ModelHandle_ProcessTimerSlots();
}

void ModelHandle_ProcessDryRun(void)
{
    ModelHandle_SoftDryRunHandler();
}

uint8_t ModelHandle_GetPowerRestoreMode(void)    { return powerRestoreMode; }

void ModelHandle_SetPowerRestoreMode(uint8_t mode)
{
    if (mode > 2) mode = 0;
    powerRestoreMode = mode;
    ModelHandle_SaveModeState();
}

void ModelHandle_SetDryRunTime(uint32_t seconds)
{
    if (seconds < 10)   seconds = 10;
    if (seconds > 3600) seconds = 3600;
    sys.dry_run_time_s = seconds;
    ModelHandle_SaveSettingsToEEPROM();
}

void ModelHandle_ToggleManual(void)
{
    if (!manualActive)
    {
        restartActive   = false;
        timerActive     = false;
        semiAutoActive  = false;
        countdownActive = false;
        twistActive     = false;
        if (autoActive) { autoActive = false; autoUserLocked = true; }
        stop_motor();
        manualActive = true;
        dryState     = DRY_IDLE;
    }
    else
    {
        manualActive = false;
        stop_motor();
    }
    ModelHandle_SaveModeState();
}

void ModelHandle_ManualToggleMotor(void)
{
    if (!manualActive) return;
    if (Motor_GetStatus()) stop_motor();
    else                   start_motor();
}

void ModelHandle_SetDryRunAndRetry(uint32_t retry_gap_sec, uint16_t dry_time_sec)
{
    if (retry_gap_sec < 10) retry_gap_sec = 10;
    if (dry_time_sec  < 10) dry_time_sec  = 10;
    sys.gap_time_s     = retry_gap_sec;
    sys.dry_run_time_s = dry_time_sec;
    ModelHandle_SaveSettingsToEEPROM();
}

/* -------------------------------------------------------------------------
 * Timer is only allowed when AUTO mode is ON.
 * Button3 press will only enable/disable timer within auto context.
 * -------------------------------------------------------------------------*/
void ModelHandle_Button3_SinglePress(void)
{
    /* Guard: timer only works when auto mode is active */
    if (!autoActive) return;

    if (!timerActive)
    {
        /* Keep auto active, just enable timer within it */
        timerActive        = true;
        motorOwner         = MOTOR_OWNER_TIMER;
        timerState         = TIMER_RUN_TEST;
        timerStateDeadline = 0;
        dryState           = DRY_IDLE;
        ModelHandle_ProcessTimerSlots();
        ModelHandle_SendTimerInfoUART();
    }
    else
    {
        timerActive = false;
        /* Return ownership to AUTO */
        motorOwner  = MOTOR_OWNER_AUTO;
        dryState    = DRY_IDLE;
        stop_motor();
    }
    ModelHandle_SaveModeState();
}

void ModelHandle_StopAllModesAndMotor(void)
{
    clear_all_modes();
    stop_motor();
    dryState = DRY_IDLE;
    ModelHandle_SaveModeState();
}

void ModelHandle_FactoryReset(void)
{
    sys.gap_time_s     = 0;
    sys.retry_count    = 0;
    sys.uv_limit       = 190;
    sys.ov_limit       = 270;
    sys.overload       = 0.0f;
    sys.underload      = 0.0f;
    sys.maxrun_min     = 300;
    sys.dry_run_time_s = 300;
    sys.dry_run_enable = 0;
    ModelHandle_SaveSettingsToEEPROM();

    powerRestoreMode = 0;
    ModelHandle_SaveModeState();
}

