Amiya200/stm32_water_tank/Core/Src/model_handle.c
void ModelHandle_SetDryRun(bool on)
{
    sys.dry_run_enable = on ? 1 : 0;
    if (!on) dryState = DRY_IDLE;
    ModelHandle_SaveSettingsToEEPROM();
}

bool ModelHandle_GetDryRunEnable(void) { return dry_protection_enabled(); }

void ModelHandle_SetOverLoad(bool on)
{
    if (!on) sys.overload = 0.0f;
    else if (sys.overload < 0.1f) sys.overload = 9.0f;
}

void ModelHandle_SetOverUnderVolt(bool on)
{
    if (!on) { sys.uv_limit = 0; sys.ov_limit = 0; }
    else
    {
        if (!sys.uv_limit) sys.uv_limit = 190;
        if (!sys.ov_limit) sys.ov_limit = 270;
    }
}

void ModelHandle_ClearMaxRunFlag(void)  { senseMaxRunReached = false; }

const TimerSlot* ModelHandle_GetTimerSlots(void) { return timerSlots; }

void ModelHandle_ProcessUartCommand(const char* cmd) { (void)cmd; }

bool ModelHandle_IsOverload(void)       { return senseOverLoad; }
bool ModelHandle_IsUnderload(void)      { return senseUnderLoad; }
bool ModelHandle_IsDryRunActive(void)   { return senseDryRun; }
bool ModelHandle_IsVoltageFault(void)   { return senseOverUnderVolt; }
bool ModelHandle_IsMaxRunReached(void)  { return senseMaxRunReached; }
uint8_t ModelHandle_GetTankLevelPercent(void) { return get_tank_level_percent(); }
bool ModelHandle_IsTankFull(void)       { return isTankFull(); }
bool ModelHandle_IsManualActive(void)   { return manualActive; }
uint16_t ModelHandle_GetAutoGap(void)   { return auto_gap_s; }
uint16_t ModelHandle_GetAutoMaxRun(void){ return auto_maxrun_min; }
uint8_t  ModelHandle_GetAutoRetry(void) { return auto_retry_limit; }
